[
{"title": ["Swift PH #21: Swift 5, Localization, and Core Data"], "body": "SwiftPH has always been an avenue for iOS developers to share knowledge, find colleagues, and learn more about technology which is why this every month there is a meet up! Last month’s  was hosted by Stratpoint.For this month, three topics were discussed.The first speaker was . She did her presentation using Xcode Playgrounds. Swift 5 was released March 2019, with it came Xcode 10.2.She showed us all of the new features that was introduced with Swift 5. There are no breaking changes in Swift 5 and that it is source code compatible with Swift 4.2 she said. Because of this, migrating legacy projects to Swift 5 will be easy.Because she was using Xcode Playgrounds for her presentation, she easily showed us the new features with comparison to Swift 4.2 syntax. is a Lead Software Engineer at Stratpoint. She’s been developing native iOS applications since 2013. She also completed Data Science bootcamp by an AI inclined company and now, she’s currently exploring cross-platform app development using React Native and Flutter.The next presenter was . He showed us the core components of , and how these components work together. He explained how easy it would be to setup and use Core Data.Core Data is not a  it’s an Usage of Core data should be done in a denormalized manner, which Matt showed us by doing a demo of an Expense Tracker app on this .Pros of using Core DataCons of using Core Data has been writing iOS apps since 2012 and have had clients locally and abroad. He also teaches iOS Development on an occasional, part-time basis.The last presentation was done by . He started out his topic by asking the participants about their knowledge on Localization. Who here knows Localization? *raises hand* Oh alam nyo na pala eh *laughs* (So you guys already know about it)Cris had a lively presentation, people were laughing all over. He showed us how easy it is to localize an application and that the only hard part in localization is translation. is a software engineer that loves to explore and implement things. He has been working for almost 7 years in software development and is currently working in Marine Benefits as a Business Developer.We would like to thank  for hosting us,  for setting up the venue, and ,  &  for sharing their knowledge with the group.Find us at on , , and . Let us know what you want to see in our future meetups. Don’t forget to leave a comment about what you think.Zonily Jame Pesquera is a Software Developer primarily dealing with iOS Development in Swift.Article link: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in By using this site, you agree to our updated "},
{"title": ["Happy 17th Anniversary, Stratpoint!"], "body": "It was a double celebration for Stratpoint last Oct 28 – Halloween Party and its 17th Anniversary!Mancom members showcased latest updates and plans for the company. Employees can’t wait to see and participate in the developments that will be done in the coming years.Stratpoint CEO, MR Dela Cruz presented the Mission and Vision of the company and discussed how we can all contribute to achieving Stratpoint’s 2020 Vision to become the premiere choice for software development and digital enterprise in Southeast Asia.The Sales & Marketing team also awarded the winners of the company’s Tagline Contest and Photo-liking contest. Lucky winners were Erik Jacob who won a GoPro Hero for the tagline contest: “Innovate. Deliver. Inspire.” That is the new tagline for Stratpoint’s 17th year. Chinoy Aller went all out in promoting his photo showing why he’s #ProudToBeStratpoint and got 800+ likes on Facebook. He got an iPad Mini for the photo-liking contest! Congratulations Guys!After the general assembly, the program for the Halloween party began. 4 Stratpoint Houses presented their 1-min skits depicting the Disney movie of their choice. The force is strong with Green Patatas as they finished 4th for acting out fight scenes from Star Wars while wearing their masks, Jedi, and storm trooper outfits. Red Kabute were all in Indian and Western costumes acting out scenes from Pocahontas with the music Colors of the Wind, they came in 3rd. Black Bawang were all in it together finishing 2nd, dancing with tunes from the movie High School Musical. The first place was awarded to Blue Luya, who depicted exciting fight scenes from Pirates of the Carribean, with complete props like the actual ship, waves and swords.It was an exciting event! Can’t wait for what’s in store for us in December for the Christmas party! Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , By using this site, you agree to our updated "},
{"title": ["Stratpoint Consultant, Drew Perez talks about Big Data at the Cloud Summit 2015"], "body": "Stratpoint’s consultant and Big Data expert, Drew Perez, was invited to speak during the Cloud Summit last Oct 7, 2015, at the Makati Shangri-La Hotel.Drew was the Senior Instructor for US Department of Homeland Security, US Army Intelligence and Command, Co-founder of Lockheed Martin Center for Security Analysis. He is in charge of the Intelligence solutions for Highfleet, Inc. & Amberoon Inc. and is currently the Managing Director of Adatos.During his morning session for CIOs, CTOs and CEOs of various companies, Drew talked about Monetizing Big Data. He pointed out that:Big Data is useless without Analytics\nYou can’t find enough Data Scientists\nMany don’t have experience in Big DataSome Key Takeaways:One of the most important principles that should be applied to business: The OODA Loop: You have to be fast or you will die. The OODA Loop was developed by military strategist and USAF Colonel John Boyd. The concept was applied to the combat operations process, often at the strategic level in military operations.Data Munging is mundane tedious work but absolutely necessary for analytics. Unless the data is sufficiently clean; you can’t do proper analytics.Business Intelligence and Data Mining only result of an average of 80% ROI; that implies for every $1 dollar spent you only make back 80 cents.On the other hand, understand the root causes and having the capability to build predictive models result in an average 240% ROIIt’s all about ROI. Without solid analytics, you won’t realize ROI from Big Data or Analytic IT investments.Drew’s talk for the second segment uncovered business growth opportunities through data science. It covered how real-time information can be used to make sound business decisions faster, and how to unlock the business potential of stagnant data archives. (ipc.ph)Here’s a summary of Data Science 101:Big Data IT is useless without Analysts doing Analysis. Business Intelligence is generally no better than making graphs from data; there is no analysis involved.Key points:This is an opportunity for Philippines to tool up on this skill set and leapfrog other countries BPO offering to become a world leader in providing Data Scientists.If we don’t learn these skills we may be obsolete within 5-years Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , By using this site, you agree to our updated "},
{"title": ["GitFlow Tool"], "body": "GitFlow is a workflow for development practice which works with different branches to manage easily each phase of software development. To manage this workflow more easily, there is a tool you can use which is also named git flow which is spearheaded by Vincent Driessen.Stratpoint Senior Software Engineer, Eco Dela Cruz, discussed the basic concepts of GitFlow tool, it’s different commands and how it makes implementation of git flow easier. I also discussed how it makes the development more organized and the advantages and disadvantages of using GitFlow tool.Eco also did a demo on how git flow can be applied to a certain project.GitFlow works with 5 main different branches namely:GitFlow tool is perfect for versioned releases. It’s a merged base solution and does not rebase feature branches.\nYou can still use git and all its commands normally as you know them, git flow is only a tooling collection.  Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in By using this site, you agree to our updated "},
{"title": ["Xcode Tips and Tricks"], "body": "Some takeaways from Tin Alcachupas’ talk on XCode during the Stratpoint Brown Bag Session.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , By using this site, you agree to our updated "},
{"title": ["Stratpoint Financial Wellness Session"], "body": "Stratpoint invited Mr. Rogel Morales, a financial wellness coach to talk about the present state of the economy and how we can take part of its continuous growth.In his talk, he presented the current positive data:Philippine Economy (GDP):5.6%\nInflation Rate: Average 1.6% (2015)\nGIR: $80 Billion ++\nStronger Peso against US Dollar\nThe Philippines is a new Tiger EconomyHe also stated some facts about how employees ages 25-35 are currently doing financial and what how they’ll do at retirement age. US Statistics show that almost half of 100 employees will be broke on retirement age (based on the spending activities), what more for the Philippines?  So what are we supposed to do about this?He explains the relationship between saving, investing and spending.In order for us to do financial planning, we should choose which to prioritize:Remember the process of Financial PlanningTake control, have discipline.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in By using this site, you agree to our updated "},
{"title": ["Stratpoint’s Powerhouse Team as Speakers at SOFTCON.ph 2015"], "body": "SOFTCON.ph 2015: Breaking The Code was organized by the Philippine Software Industry Association (PSIA). The two-day event was held at the Marriott Grand Ballroom in Pasay City last Nov 4 and 5, 2015.The opening remarks was given by Winston Cruz, SOFTCON.ph 2015 Chairman. He says that events like these will continue to promote Philippines as a hub for IT resources, he also added that we already have a place in the global market.Commissioner Monchito Ibrahim of the Information & Technology Communications Office gave the opening address wherein he highlighted that we should continue to exhibit Filipino talent & software expertise so we can show the world that the Philippines is a reliable partner in software services.The SOFTCON.ph 2015 highlighted several discussions such as Our two top executives were in invited to be speakers/moderators for the following discussions.Stratpoint Executive Chairman, Paco Sandejas was one of the panelists in the discussion on the Start-up Ecosystem & InvestmentStratpoint CEO, MR Dela Cruz moderated the panel discussion on Big Data Analytics.Drew Perez, Former Senior Instructor for US Dept. Of Homeland Security, and CEO of Adatos, talked about Big Data and how we can use it for our country’s development.The event ended with a summary and synthesis of all the topics, raffle and the closing remarks by Jonathan De Luzuriaga, PSIA President.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , By using this site, you agree to our updated "},
{"title": ["Effort Estimation for QAs"], "body": "Effort estimation was the topic for the recently held Brown Bag session led by Lyndon Catalan.Effort estimation is the process of predicting the most realistic amount of effort (expressed in terms of person-hours or money) required to develop or maintain software based on incomplete, uncertain and noisy Effort estimates may be used as input to project plans, iteration plans, budgets, investment analyses, pricing processes and bidding rounds.Lyndon discussed the different approaches for the following effort estimation categories: Expert Estimation, Formal Estimation Model, and the Combination-based Estimation Model.After the session, QA team members shared their challenges, experiences and things to consider when estimating efforts for different projects.Some key take-aways from the discussion:A high estimation error does not automatically mean that the resource who estimated has low estimation ability. Factors for errors include wishful thinking, anchoring, planning fallacy, and cognitive dissonance.Tips on how to increase estimation accuracy:Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , By using this site, you agree to our updated "},
{"title": ["iOS Instruments and App Performance Optimization"], "body": "Stratpoint brown bag speaker and Lead Software Developer, Paolo Alcabao talked about the 3 Basic Tools in Instruments. Attendees were iOS developers who saw various demonstrations of using these tools.Here are some key takeaways from the talk: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , By using this site, you agree to our updated "},
{"title": ["Autolayout Basics"], "body": "Adrian Cayaco, Lead Software Engineer of Stratpoint did a demo and showed that using XCode Auto Layout is not as hard as you think.\nhere’s a summary of his discussion:The intrinsic size area expands with areas to enter width and height.4. Set appropriate values for the width and height.Unlike standard views, custom views have no defined intrinsic content size. During design time, Interface Builder doesn’t know what size to expect a custom view to be, so set a placeholder intrinsic content size to indicate the custom view’s content size.If you don’t set a placeholder intrinsic content size, the view may have ambiguous layout constraints. Interface Builder shows ambiguity by drawing frames with orange borders.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.How big am I? (w, h) –  Posted in , , By using this site, you agree to our updated "},
{"title": ["Defect Management"], "body": "The topic of the brown bag by QA Engineer, Emman Unera is Defect Management.Defect management is a process of monitoring a bug from its detection up to closure. A bug can be considered as a bug if it deviates from the documented specifications. Upon the detection of a bug a proper report should be done. This presentation discussed some practices that can improve the quality of a bug report. After a bug is reported, it should be monitored using various tracking tools such as scrumboard and online defect management tools.Defect Management also includes the various actions such as bug fixing and defect triage. Defect Triage is a process of  sorting, discussing and assigning bugs done by the PM, QA and Dev.During the presentation, inputs coming from the experiences of both the developers and QA’s fueled several discussions and knowledge sharing.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in By using this site, you agree to our updated "},
{"title": ["Gradle Tips and Tricks"], "body": "Chinoy Aller shares Gradle tips & tricks to coworkersHere’s a summary:Gradle is a build tool and dependency managerInnovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , , , By using this site, you agree to our updated "},
{"title": ["Alamofire"], "body": "Stratpoint Software Engineer, Mylene Bayan talks about Alamofire. Here are some notes from her presentation.is an HTTP networking library written in Swift.>Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , By using this site, you agree to our updated "},
{"title": ["Android Third Party Libraries"], "body": "Aid Bucayan talked about learning how to use the four most popular networking libraries & image caching: Avoid HttpUrlConnection and HttpClient\nOn lower API levels (mostly on Gingerbread and Froyo), HttpUrlConnection and HttpClient are far from being perfect. There are some known issues and bugs that were never fixed. Moreover, HttpClient was deprecated in the last API update (API 22), which means that it will no longer be maintained and may be removed in a future release.\nThese are sufficient reasons for deciding to switch to a more reliable way of handling your network requests.It’s much faster. It caches everything and perfect for small metadata operations.“Retrofit turns your REST API into a Java interface.” It’s an elegant solution for organizing API calls in a project. The request method and relative URL are added with an annotation, which makes code clean and simple.With annotations, you can easily add a request body, manipulate the URL or headers and add query parameters.Adding a return type to a method will make it synchronous, while adding a Callback will allow it to finish asynchronously with success or failure.Glide is a fast and efficient open source media management and image loading framework for Android that wraps media decoding, memory and disk caching, and resource pooling into a simple and easy to use interface.Picasso is an image library for Android. It’s created and maintained by Square, and caters to image loading and processing. It simplifies the process of displaying images from external locations. In many cases only a few lines of code is required to implement this neat library.Picasso shines for displaying remote images. The library handles every stage of the process, from the initial HTTP request to the caching of the image. This can be quite verbose when writing code to perform these actions yourselfReferences:\n\nInnovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , , By using this site, you agree to our updated "},
{"title": ["Businessman Urges Govt: Just Do It"], "body": "Stratpoint Chairman and Venture capitalist Francisco “Paco” Sandejas offered his insights as a representative of the private sector during the Philippine Yearend Economic Briefing on February 13.“The accomplishments are just the beginning. There’s still much work to be done,” noted Sandejas, managing partner of Manila-based Narra Venture Capital, as he acknowledged the various economic and fiscal improvements under the Aquino administration.“What are the things we can really do to make big changes?” he asked at the briefing attended by the country’s top economic managers.Answering them, he shared 4 key points that well-managed corporations already do and which he urged the government officials to practice too.Read the full article at: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged By using this site, you agree to our updated "},
{"title": ["Outsourcing: The Philippines vs. China and India"], "body": "As the looks for new avenues for growth, it needs to be more nimble than China or India in looking for new opportunities. According to the Philippine Software Industry Assn. (PSIA), the industry had $423 million in revenues from both outsourced and product software in 2007, up from $200 million in 2005, and currently employs around 28,000 software developers. In 2009 most of its business will come from customer support activities such as project maintenance and customer-requested modifications, with a smattering of new-product sales. Compared with countries such as China and India, argues Beng Coronel, the current PSIA president, the Philippines has better infrastructure and a cultural affinity with the U.S.Read the full article at: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , By using this site, you agree to our updated "},
{"title": ["Okayama Delegates visit the Philippines"], "body": "The Okayama International Business Association (OIBA), an organization whose mission is to promote the Japanese companies and find partners around Asia, has chosen the Philippines for their 2016 Okayama Economic Mission.Since 2012, OIBA has been to China, Myanmar, Laos, Vietnam and Indonesia.   This 2016, they visited the Philippines hoping to build long-term relationships with different organizations ranging from manufacturing, logistics, and software development – one of which is Stratpoint.On Feb 15, 2016, Stratpoint CEO, Mary Rose dela Cruz, together with Sales and Marketing Director, Gigi Lariosa attended the  Okayama Philippine Business & Economic Mission fellowship dinner at Jen Hotel, to launch OIBA mission here in the country.Local guests include Elmer San Pascual, representing Dr. Lilia de Lima, Director General of the Philippine Economic Zone Authority (PEZA), and Junichiro Suzuki, Trade and Commercial Attache of the Embassy of Japan.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , By using this site, you agree to our updated "},
{"title": ["Stratpoint adviser awarded with the 2014 Washington Sycip Distinguished Management Leader Award"], "body": "Stratpoint Technologies Inc. adviser and Tallwood Venture Capital Managing Partner Dado Banatao was recently honored by the Asian Institute of Management (AIM) as the recipient of the 2014 Washington SyCip Distinguished Management Leader Award. The awarding ceremony was held last June 27, 2014 at AIM Conference Center in Makati, Philippines.“For his exemplary lifetime leadership in engineering, technology, and innovation, and his commitment to uplifting science and technology education in the Philippines, the Asian Institute of Management is proud to confer the Washington SyCip Distinguished Management Leader Award on Mr. Diosdado “Dado” Banatao this June 2014.” (AIM, 2014).Photo Credit: AIM. (2014).Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in Tagged , , , By using this site, you agree to our updated "},
{"title": ["Risk-based Testing"], "body": "Lyndon Catalan, Stratpoint’s QA Lead, discussed Risk-based Testing with his fellow QA testers.Software development has now evolved into a fast-paced environment. In order to cope with these changes, new QA principles and standards are put in place. One of these is Risk-based testing. Risk-based testing is an organizational principle used to prioritize the test based on the risk of failure, the function of their performance, and likelihood or impact of failure.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , , By using this site, you agree to our updated "},
{"title": ["Will Android fragmentation spoil its IoT appeal?"], "body": "The openness of Android may be good for consumers, but it hurts the platform’s potential for wearables and the Internet of Things (IoT) . Developers who were already frustrated with Android fragmentation are finding IoT design a real nightmare—and many are opting to build their first products on iOS instead.Google has responded by making the platform less open, but it may be too late. If Android is forever a mess of not-quite-compatible platforms, should developers keep IoT development focused on iOS?See more at: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , Tagged , By using this site, you agree to our updated "},
{"title": ["‘Technopreneurship’ Turns Nerds into Traders"], "body": "The idea is to turn classroom nerds into successful entrepreneurs and help the Philippines become the next Silicon Valley.\nFor Dado Banatao, chair of the Philippine Science and Technology Development Foundation-Manila Inc. (PhilDev), the country’s growing economy may get an even bigger boost through technology.\nBanatao, also known as the Philippines’ “Father of Semiconductors,” believes that, with the right innovation and solution, Filipino engineering students may help push the country’s development by coming up with value-added technology to take to the global market. Read the full news article at: Dado Banatao is also one of Stratpoint’s advisors.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in Tagged , By using this site, you agree to our updated "},
{"title": ["Mobile Trends:It’s Time for Developers to Think Beyond the App"], "body": "The mobile app trends for 2015 and beyond are being driven by three major changes in the telecom and IT industries: the availability of low-cost mobile devices, ubiquitous Internet connectivity, and the proliferation of low-cost cloud-based services. I discuss each of these in detail below.This environment is driving three major trends with respect to app functionalities: apps that aggregate and publish content, apps that act like a platform for other apps, and apps that become the collection tool for personalized data. All these are now pushing developers to adopt a new model for app development, one that involves building not just an app, but a “service.” Success with this new model hinges not just on their development skills but, more critically, on their operational capabilities.Read the full article at: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in Tagged By using this site, you agree to our updated "},
{"title": ["IBM Phils: PH is Ready to go Beyond Outsourcing"], "body": "IBM Philippines pledged to bring more jobs in software development support services this year, saying it is time the country went beyond business process management (BPM). Luis Pineda, president and general manager of IBM Philippines, believes the country can handle deep-skilled work because of a highly trainable talent pool.He noted that during the early stages, the industry struggled to attract high-value outsourcing services because of the lack of maturity and confidence of human resources. However, with industry players and the academe providing soft and technical skills trainings, the country is now capable of handling knowledge-based support services.IBM is preparing the next generation of talent through the IBM-Ched collaboration for Smarter Analytics Education.Read the full article at: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in Tagged , By using this site, you agree to our updated "},
{"title": ["IoT Apps Trend: 3 Essential Ingredients for Success"], "body": "Is 2015 the year Internet of Things (IoT) hype turns into opportunity? Should you invest in IoT apps and services?If you are an independent developer, the answer is yes, but proceed with caution . The risks and are still high, but IoT app development is easy enough that you can roll out small-scale deployments with a modest investment. Creating these exploratory products now can prepare you for the larger opportunities ahead.Read the full article at : Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , By using this site, you agree to our updated "},
{"title": ["Let’s talk in the DarkRoom"], "body": "      Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.This new app takes private conversations into the digital age.Darkroom, the ground-breaking chat service out of Silicon Valley which features private and secure real-time messaging, recently celebrated its global launch in Manila. DarkRoom’s Director for Engineering, Renata Fuller, flew in from the US to closely collaborate on the release of the app with development team partner Stratpoint Technologies, Inc. (). Darkroom’s end-to-end software engineering from programming on iOS and Android, to server development and management and testing and quality assurance, are all done in the Philippines by a dedicated team within Stratpoint.To make this real-time service possible, Stratpoint collaborates with PubNub (), one of the hottest startups from the Silicon Valley. PubNub’s Data Stream Network provides global cloud infrastructure and key building blocks for real-time interactivity. It powers hundreds of real-time apps around the world, from innovative start-ups to globally recognized brands such as Yahoo, CBS, and Vimeo. Darkroom is now available at the Apple iTunes Store. You can check out how useful this app can be for you by visiting .Posted in Tagged , , , , , , By using this site, you agree to our updated "},
{"title": ["Backbone.js and Grunt"], "body": "Stratpoint’s lead software engineer, Kevin Ventura, spoke during the weekly Stratpoint Brown Bag Session.Kevin talked about the key features, concepts, and when to use Backbone.js in Stratpoint projects. He also discussed its simplicity against other frameworks. Kevin also highlighted the use of Grunt, a JavaScript task runner to build modern web applications and other modern technologies available.Backbone.js gives structure to web applications by providing models with key-value binding and custom events, collections with a rich API of enumerable functions, views with declarative event handling, and connects it all to your existing API over a RESTful JSON interface.Grunt gives automation for repetitive tasks like minification, compilation, unit testing and linting.  References:Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in By using this site, you agree to our updated "},
{"title": ["Saluting Filipina Women Business Leaders"], "body": "Stratpoint’s CEO, MR dela Cruz, participated in the first-ever all women bell-ringing ceremony at the market open of the Philippine Stock Exchange (PSE) this morning, September 15. MR joined women chairpersons, chief executives and managers invited by the Corporate Women Directors International (CWDI) in saluting Filipina women business leaders.Philippine Stock Exchange Chairman, Mr. Jose T. Pardo gave the opening remarks. He said this is the first time there had been this many women executives on the PSE trading floor. “I have best wishes for the CWDI in championing the status and women’s success.” Pardo said.Ms. Irene Natividad, the President of Global Summit of Women, and Chair for Corporate Women Directors International also announced that this market open also launches the APEC Women in the Economy 2015 Fora, a series of events promoting gender integration, gender equality and women empowerment among other campaigns.This event marks the very important role women leaders played in the growth of the economy. Ms. Natividad ends her speech with hopes that the image of women opening the stock exchange will be remembered and will continue to inspire younger women to succeed.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in By using this site, you agree to our updated "},
{"title": ["How the Philippines Became Tech Startups’ New Source for Talent"], "body": "By Oliver Segovia, via Harvard Business ReviewFifteen years ago, Fort Bonifacio in the Philippines was a former military base still dotted with barracks built in World War II. Thanks to an aggressive privatization and conversion program, Bonifacio Global City — as the base is known today — is a modern, bustling financial district lined with blocks of skyscrapers, shopping malls, and luxury condos.The Southeast Asia city’s rapid growth echoes the story of the so-called  — technology start-ups that rapidly grew to a billion-dollar valuation and beyond. So far, 2015 has . But as start-ups mature, the grow-at-all-cost narrative will be replaced by a flight to capital efficiency and profitability.In this next chapter, the Philippines — the world’s  — will play a crucial role in helping tech companies access the talent to scale efficiently and sustainably.Read the full article at Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , By using this site, you agree to our updated "},
{"title": ["RecyclerView"], "body": "The RecyclerView recycles the view item whenever it goes out of scroll and reuse it for the new item automatically.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , By using this site, you agree to our updated "},
{"title": ["SurfaceView Content"], "body": "Working with SurfaceViewWhat is SurfaceView?Why use SurfaceView?Disadvantage of Using SurfaceView?Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , By using this site, you agree to our updated "},
{"title": ["Stratpoint at the International Sourcing Programme for ICT and IoT"], "body": "Stratpoint, represented by its Sales & Marketing Director, Gigi Lariosa, attended the International Sourcing Programme for ICT and IoT. This event was held in Kuala Lumpur, Malaysia last April 19-22, 2016.The programme was organized by The Embassy of Malaysia Trade Office (MATRADE) to allow Malaysian suppliers to showcase their products and services to countries from all over the world. In turn, these companies also get to network with various organizations with a common interest.In their letter of appreciation, MATRADE thanks the attendees for making the event a successful one. And hopes that this created more opportunities to find potential business partners.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint’s First Quarter GA"], "body": "Stratpoint held it’s first General Assembly for the year last Mar 16, 2016.It started off with the introduction and welcoming of our new employees.Mancom members presented updates and achievements of their respective departments.We finally launched our Digital Enterprise Journey with a healthy pipeline composed of Amazon Web Services (AWS) and Adobe Experience Manager (AEM) opportunities and upcoming projects to be closed soon.Our financial performance has improved significantly and Stratpoint’s consolidated net results have been positive over the last 3-years. 2015 profitability was strong, as we have delivered over 100% growth in net results compared to the same period last year.Our very own, Ronald Dela Cruz, Technical Lead for Stratpoint, also showed his brilliant creation – Gorjs Framework. It is a start-up kit for developers to assist with their app-building; A Full Stack, Pure JavaScript Web Application Starter Kit, built with React, Node, and Backbone. Database backed by SQLite.Apart from the business side of Stratpoint, its Events Committee showed the calendar of activities for all employees – including team building, sports fest, and various games to be played all through out the year!After the GA were a bit of socials – drinks and food were served. It was an insightful and enjoyable GA.Here at Stratpoint, were not all about work, we know how to have fun!Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["ICT Awards 2016"], "body": "The International ICT Awards Philippines was launched in 2007 by the Canadian Chamber of Commerce of the Philippines (CanCham) in  cooperation with the then BPAP (now IBPAP).Winners of awards have ranged from widely-known major companies that are the mainstay of the IT-BPM industry in the country to small emerging companies that have stimulated dynamic growth and new developments.The International ICT Awards Philippines are supported entirely by the private sector sponsors and by fees charged to participants in the annual events, and by the time provided by the professional staff of CanCham and IBPAP.This year, Stratpoint is one of the nominees for Best Software Company of the year. During the Gala night on Mar 22, 2016, Stratpoint CEO, MR Dela Cruz and Sales & Marketing Director, Gigi Lariosa, met with the other IT and BPO companies for the dinner party and awards ceremony. Reference:Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Kudos to Stratpoint’s Apple Team"], "body": "Stratpoint’s engagement with Apple started in October 2014. Our Apple QA team has worked on several projects and always makes sure that quality work is delivered on time for all their clients and this is what Apple values most importantly. As of today, our Apple QA Team have worked on more than 15 projects for Apple’s Global HR department, one of which is the .Just recently, they finished 2 more internal projects and received acknowledgement and recognition from the Apple Team.“” – Wayne Aono, Apple GLobal SolutionsTess Taft, Manager, Global HR Solutions QA for Apple also thanked the team for continuing to keep an eye on Apple projects.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , , , , , By using this site, you agree to our updated "},
{"title": ["Philippine Startup Influencers of this Generation"], "body": "E27 is a community of mentors, partners, investors, colleagues, and customers where people can find news, community events, talent, and funding .They recently featured the top 27 Philippine startup influencers of this generation.Among the 27 are Stratpoint’s Adviser, Dado Banatao and Stratpoint’s Executive Chairman, Paco Sandejas.Diosdado “Dado” Banatao is primarily known to the Filipinos for his backstory, being the son of a farmer from a small barrio in Iguig in Cagayan Valley who would eventually grow up to pioneer the PC chip set and graphics acceleration architecture that continue to be two of the foundation technologies in every PC today. As an engineer, he is credited with developing several key semiconductor technologies and is regarded as a Silicon Valley visionary. He co-founded three technology startups, S3 (SBLU), Chips & Technologies (INTC) and Mostron, and became a venture partner at the Mayfield Fund. He would later form Tallwood Venture Capital, as its managing partner. He also serves as the chairman of PhilDev, a non-profit organization that aims to eradicate poverty through education, innovation and entrepreneurship.\nFrancisco “Paco” Sandejas is Managing Partner at Narra Venture Capital, a boutique early-stage investment group that has invested in over 25 high-technology companies, with some notable companies being Inphi, SiRF (now CSR), Ikanos, and Sandbridge. Paco serves on the board of PhilDev, UnionBank of the Philippines, Quintic, Astute Networks, Stratpoint Technologies, Colixo and Xepto Computing. Earlier, he was Vice-President of H&Q Asia Pacific, where he helped lead notable early-stage investments in Transmedia (acquired by CISCO) and HeadStrong (acquired by Genpac). With a Ph.D and M.S. from Stanford, he co-invented the Grating Light Valve (GLV), one of Stanford’s top IP money-makers. Paco is an active consultant with the Philippine Government, and advises top universities in the Philippines.You may view the whole list .Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in Tagged , , , , , , By using this site, you agree to our updated "},
{"title": ["Global Entrepreneurship Summit 2016"], "body": "Stratpoint’s Executive Chairman, Paco Sandejas will be one of the speakers during the Global Entrepreneurship Summit (GES), together with Fadi Bishara – CEO of techVenture, Ime Archibong –  the Director of Global Product Partnerships at Facebook, Brian Chesky – the co-founder and CEO at Airbnb, Sharif El-Badawi – partner lead to VCs in Google, US President Barrack Obama, plus a hundred more CEOs, founders, and leaders from different companies all over the world.The GES 2016 will be held at the Silicon Valley this coming June 22-24, 2016.The U.S. government, led by the White House, in coordination with the U.S. Department of State, the U.S. Agency for International Development (USAID), the U.S. Department of Commerce, the Small Business Association, and other partners are collaborating to host a series of events domestic and international events on the “Road to GES” in Silicon Valley this June. These activities are aimed at fostering dialogue and relationships between investors and global entrepreneurs. Along the “Road to GES,” we will continue to bring together partnership practitioners and leaders to engage in discussion on common challenges and best practices, identify new partnership opportunities, and coordinate on collaborative solutions.While we can’t bring every entrepreneur out there to Silicon Valley for the conference, we know that these important conversations are happening all around us, and being held in cities all around the world every day. Recognizing the importance of fostering these dialogues and relationships, we want to amplify these conversations, help deepen their impact, and garner more community support. Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , , , , , By using this site, you agree to our updated "},
{"title": ["OFWs returning to the Philippines"], "body": "An article By Trefor Moss for the Wall Street Journal featuring Paco Sandejas.MANILA—For years Filipinos with professional ambitions knew the surest way to realize them: leave the Philippines.Since the 1970s, Filipinos by the millions have left the country—many for jobs as domestic helpers, chauffeurs and construction workers, but also doctors, academics and tech professionals who saw no prospect of earning a good salary or achieving their career goals at home.But the trend is finally turning. Talented Filipinos once driven overseas by their country’s stagnation are beginning to return in greater numbers, raising hopes that the “brain drain” that has stunted development may finally be going into reverse. Political stability and economic growth—averaging 6.2% between 2010 and 2015, second only to China’s among East Asia’s major economies—are changing perceptions among the Philippines’ diaspora.President Benigno Aquino III recently said the number of overseas Filipinos may be as low as 9.4 million, and cited the decline as one of his administration’s main achievements.“A lot of people were turned off by the previous administration and all the stories of corruption—the country had an image crisis,” said Mr. Oriel, referring to the years before Mr. Aquino became president in 2010. “But now a lot of these people are seeing the Philippines as somewhere they can seriously think about going back to.”Paco Sandejas was at Stanford University in the 1990s when he founded the Brain Gain Network, a community of overseas Filipino technology professionals he hoped would work together to counter the so-called brain drain, or the emigration of highly qualified Filipinos.“We didn’t attract much interest” at the time, Mr. Sandejas said. “Many just said, ‘Why would I want to do that? The Philippines is such a mess.’ But now the tide has turned, there are many people coming back.”And some are coming back to establish startups or take senior executive roles at existing companies, bringing a new dynamism to the economy.Today Mr. Sandejas runs Narra Venture Capital, one of several venture-capital firms in Manila’s nascent startup scene. The Brain Gain Network—which connects Filipino expENLARGatriates with one another and with potential employers in the Philippines—has grown to 2,500 individuals.Nearly half of the Filipinos abroad are thought to have settled overseas permanently, according to the Commission on Filipinos Overseas. But some of them are having a change of heart.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , By using this site, you agree to our updated "},
{"title": ["Stratpoint at IPC’s Cloud Summit 2016"], "body": "Stratpoint attended the Cloud Summit 2016 held on June 28 at SMX Aura.formally opened the summit by giving insights on why enterprises need to to maximize their growth potential via today’s array of digital tools and solutions.talked about the Internet of Things and how enterprises have to continuously innovate to sustain their growth, citing industries such as insurance and automotive as early adopters of IoT globally. talked discussed why enterprises need to go digital and what it means for employees.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint as One of the Sponsors at the AWS Summit"], "body": "Amazon Web Services held its annual AWS Summit in Manila, Philippines, last May 5, 2016.  This free event is designed to educate new customers about the AWS platform and offer existing customers information on architecture best practices and new services. Attendees were encouraged to come early to hear an exciting keynote with new announcements, great customer stories and attend the afternoon breakout sessions covering hot topics like new services, architecture, performance, operations and more.Here’s the program for STARTING WITH AWS:You want to move your organization and applications into cloud and take the advantages that cloud can offer, but you also notice the complexity and challenges of migrating to cloud at the same time. Do you just forklift your application or do you re-architect it? In this session, we will discuss Rackspace’s opinionated view on migration to the cloud and introduce an Act-Optimize-Pioneer approach to make the migration process more straightforward and also how different tools in the Amazon Web Services toolkit and the partners in the Amazon Web Services can further ease your migration., Partner Solutions Architect, Amazon Web Services, APAC\n, Solution Architect, RackspaceWhen getting started with cloud one of the initial considerations is what is the first workload to target? Digital workloads provide a good opportunity to explore the breadth of the Amazon Web Services platform, they help you build confidence and understanding on how cloud can enable you to rapidly achieve your business outcomes, and drive innovation. In this session we will showcase different types of digital workloads that you can get started with on the Amazon Web Services platform and provide practical demonstrations and guidance on how to rapidly deploy and scale digital workloads to meet your business demand., Solutions Architect, Amazon Web Services, ASEANWhile security is a top concern in every organization these days, it often gets a bad rap. In many minds, security has the reputation of the bothersome villain who attempts to hinder performance or restrain agility. In this session we will outline four strategies to protect your valuable workloads, without falling into traditional security traps. We will walk through three stories of EC2 security superheroes who saved the day by overcoming compliance and design challenges, using a (not so) secret arsenal of AWS and Trend Micro security tools., Solutions Architect, Amazon Web Services, ASEAN\n, Solution Architect, Trend Micro, Partner Solutions Architect,  Amazon Web Services, APAC, Director of iO, WhispirAmazon Web Services provides a number of database management alternatives for all types of customers. You can run managed relational databases, managed NoSQL databases, a petabyte-scale data warehouse, or you can even operate your own online database in the cloud on Amazon EC2. Discover our database offerings and find what service to use according to your existing needs or how to deliver your next big project. Find out about data migration services, tools and best practices for security, availability and scalability, and hear some of the great database customer success stories on Amazon Web Services., Business Development Manager – Database Services, Amazon Web Services, APACAmazon Web Services offers a wide range of tools and features to help you to meet your security objectives. These tools mirror the familiar controls you deploy within your on-premises environments. Amazon Web Services provides security-specific tools and features across network security, configuration management, access control and data security. In addition, Amazon Web Services provides monitoring and logging tools to provide full visibility into what is happening in your environment. In this session, you will get introduced to the range of security tools and features that Amazon Web Services offers, and the latest security innovations coming from Amazon Web Services., Cloud Architect – Professional Services, Amazon Web Services, ASEANRunning solutions in Amazon Web Services can help you get your applications up and running faster. By harnessing the power of the Amazon Web Services platform services you no longer have to focus on the underlying infrastructure, but instead you can focus on your application and business logic. This session will enable you to learn about the rich array of Amazon Web Services platform services available, find out how other customers are leveraging platform services and identify which services are relevant to your business. This session also includes a demonstration of Amazon Web Services for compute, database and deployment which you can use to accelerate your cloud adoption journey., Senior Cloud Architect – Professional Services, Amazon Web Services, ASEANWhether you are promoting the launch of a new phone, offering tickets to a popular singer’s concert, running an online promotion for an e-commerce store, or reporting on a breaking news story, all of these scenarios need an architecture that is agile and cost effective. Discover how the Amazon Web Services platform help you scale your applications up and down to help with unforeseen and planned user spikes. Find out how customers built their application architectures to solve their scaling problems and the benefits they found by using Amazon Web Services. In this session, we will share a live demo on step-by-step scaling on our platform., Business Development Manager – Database Services, Amazon Web Services, APACWhile cloud is fast becoming the new normal for organisations of all sizes, many IT executives & budget owners still struggle to articulate the business value of moving to the cloud in terms that resonate with the Board and Broader C suite. In this session, we will talk through the impact cloud computing is having on the overall IT cost base, not just the infrastructure layer. We will also cover what the typical non-cost benefits are, how they can be measured and communicated. Finally we will provide a framework that can be used to calculate the transformation costs associated with moving to the cloud., Business Development Manager – Database Services, Amazon Web Services, APAC Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["What Apple says about Stratpoint"], "body": "Stratpoint Apple team worked on one of our biggest projects for Apple!In the past week and a half since our launch of , we’ve heard a lot of positive feedback about the site, and it has started many discussions about how we can continue to enhance Apple’s new employee onboarding experience.Here are some responses of various Apple departments/employees: Congrats for a job well done, Stratpoint Apple Team!Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.the appPosted in , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint Attended Lecture on Social Media Policy for Gov’t Agencies"], "body": "Stratpoint attended the public lecture on “Formulating a Social Media Policy for Frontline Government Agencies to Improve Public Communication” by Dr. Clarissa C. David of the UP College of Mass Communication.The event was presented by the University of the Philippines Center for Integrative and Development Studies (UP CIDS) and UP College of Mass Communication and was held on July 5, 2016 at the Bulwagan ng Dangal Roxas St, UP Campus, Diliman Quezon City.Everyone was welcomed by Dr. Edna E.A. Co, Executive Director of UP CIDS, while the opening remarks were done by the University of the Philippines President, Alfredo E. Pascual.After the talk were discussions led by Prof. Rachel Khan, UP Journalism Dept and Ms. Chay Hofilena of Rappler.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , By using this site, you agree to our updated "},
{"title": ["Paco Sandejas at the GES2016"], "body": "Paco Sandejas was invited to be one of the speakers in Obama’s .You may view his talk here: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Paco together with Daphne Koller, President and co-founder at Coursera and Maya Adam, Founder and CEO at Just Cook For Kids and Head, Online Education, Stanford Medical School during the Global Entrepreneurship Summit 2016. #GES2016Posted in , , Tagged , , , By using this site, you agree to our updated "},
{"title": ["Marketing Fundamentals Every Startup Should Know"], "body": "Marketing is vital in every business, and most absolutely for startup businesses. Even from the start, marketing should be part of any business. It is a must for startups to know marketing fundamentals to ensure that right path would be taken towards growth and success.Second, the concept of value must be emphasized. Startups must realize the true value of what they offer. It is essential to have a mindset that the products and services of a start up business are actually providing help to the customers, that it is trying to solve a particular customer problem. There is a need for startups to systematically communicate the value to their target market. It would attract potential customers and upon winning over them and delivering the value, it would lead to customer satisfaction. Third, after identifying appropriately the market and value of startups, there must be understanding of different channels for the actual execution of marketing strategies. Channels refer to the means by which a customer intends to come in a business. It could either be via social, mobile, landing pages, call center and storefront. Startup entrepreneurs and marketers should know how to utilize them and then determine the right mix of which would work for them. But today, since it is an era wherein everything revolves around technology and Internet, investing in digital marketing must be considered by startups especially consumers around the world are now getting tech-savvy. It is a must for startups to build their presence in various digital platforms. Startups should also take advantage of using social media as means of marketing. For the past few years, there is an increasing amount of social media users with the popular social networking sites like Facebook, Twitter, Instagram, and LinkedIn to name a few. Digital marketing is a cost-effective and in trend means of marketing that startups should try on.  Fourth, metrics must be set up to measure marketing efforts. Effective measurement is important as it allows the organization to evaluate what it has been doing and learn in order to make better decisions in the future. The metrics must include specific key result areas and performance indicators to track the effectiveness and efficiency of the marketing campaigns. This would also be helpful in providing insights for ongoing marketing implementations. Overall, by recognizing marketing fundamentals, startups would have a roadmap that would enable them to compete in the challenging world of business. As technology and Internet have been continuously growing and scaling faster, startups should be able to adapt and implement marketing strategies that would lead them to the achievement of their goals. Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , , By using this site, you agree to our updated "},
{"title": ["Why Go Mobile  "], "body": "With increasingly competitive avenues through which to transfer data in the modern age, companies, organizations as well as formal institutions are increasingly looking to the mobile audience a means through which to access their services with ease and without inconveniencing the users of their applications on these devices. As people increasingly go mobile as a means of getting access to information at home and even while they are on the go, getting your services to them on this increasingly popular platform will definitely prove to be of benefit. Even as you go off on a search for the best mobile or web application to improve the flow of business activities between the providers and the final consumers of these apps.Going mobile will mean that you will finally be able to reach your audience on a much wider range. As you might have known, there are now more mobile internet users than other users in the world. This means that a mobile application will package your business in a manner that will make it effortless for the consumers to interact and do business with your company. A proper design and prototyping for the application will make it possible for your app to be as smooth as possible to use without causing any issues in regard to user interaction flows and the overall user experience.A lot of companies are currently busy investing into providing their services and offerings to their clients on an easy to use and access on a range of mobile platforms. This means making the content fit all these devices as well as stretching to fit various specifications on the browser or device operating system. Mobile app developers are qualified at coming up with quick prototypes of concepts as well as ideas to give you a feel for what the application will work and function out there in the wild. In the general look of things, this will also mean having a good designer to come up with different layouts and quick sketches to help your discussion go along well. This definitely has a huge return on the investments as it will keep in mind the mobile audience which is very crucial in the current economy. As you consider coming up with a mobile application or even a web application via which your customers can access the services you have to provide them in an easy and effortless manner.Last but not least, a good mobile or web application should not only look and feel good, but also be fast and functional enough to ease the access of services from enterprise service providers as well as huge companies who provide promotions and offers targeted at a mobile audience. Deciding on the best company to help you along with your mobile app conceptualization and final production will definitely prove useful. As you come up with an application that will change the way you conduct business, working hand in hand with adequately skilled designers and developers to take you through this amazing journey.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Checklist for Choosing a Software Developer"], "body": "Your team recently agreed on a software project for your brand. You need developers to take on the project until execution. Out of the numerous software development companies out there, how do you choose the right one? Of course you want to avoid hiring an amateur who understands and writes code but doesn’t understand the business.Here are some tips for choosing the right software developer: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , Tagged , By using this site, you agree to our updated "},
{"title": ["Factors to consider when choosing a mobile platform  "], "body": "There are things that you need to consider before choosing or building a business mobile application. If you are involved in business, it is extremely important to choose a mobile platform that works the best for your business. Remember that the market is getting bigger and bigger. People are getting more particular at what types of apps they want. If you want them to use your apps, choose something that will meet their needs. Here are factors to consider when choosing a mobile platformIt takes a lot of time to properly develop applications suitable for mobile phones. The structure that you will intend to create will be according to what you need or want. Since your goal is to make money from your apps or make available a free app to your users that provides them with good value, make sure that you choose something that will please your future customers. You also have to look into the budget of your users as well as their other requirements in choosing an app. One of the greatest thing about using mobile apps is that you can implement an upgrade without spending as much as renovating a building or training new employees.Money does matter when you build smartphone apps. You may have to spend on mobile app development software or pay an expert. Before you make the final decision, analyze your current condition with your customers. If you think you know them well and you have figured out their actual needs and wants, then you can proceed with building an app that is suitable for them. Your app must not only benefit your clients, but your own business as well. Make sure it is enhancing certain processes; otherwise, you are just wasting your money and effort.If you want to gain more users of your apps, updates are necessary. Every new content, feature and function will provide users with more advantages; thus, making them appreciate your mobile apps even more. Updating apps take time. You need to be patient and to allocate enough time in generating the upgrade. You have to be more than willing to devote adequate time especially if you are offering not just a single type of mobile apps.If your customers are using their mobiles or smartphones to locate directions, stores, restaurants, shopping centers and other things, then you may have to build mobile apps that carry this particular function. A mobile app that allows an easier and more convenient searching would definitely please your future clients. When you have apps that cater to every need of your customer, you will be able to deliver customer service at a higher level.While you consider all those things mentioned above, don’t forget to incorporate entertainment and fun. Don’t be too serious; otherwise, your mobile apps will end up looking dull and boring. Build smart apps that are unique. Create those that useful and fun to use at the same time. Many users often search for apps that is pleasurable to use.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , , Tagged , , , , , By using this site, you agree to our updated "},
{"title": ["Preparing for a Software Engineering Interview"], "body": "For those of you who are following a career path in software development, here are some advice from our developers to help you prepare for a job interview.Check out: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , Tagged , , , By using this site, you agree to our updated "},
{"title": ["Android Programming for Beginners by Google"], "body": " offers to teach beginners how to build a simple Android app in Java.Students can be anyone who has used a smartphone – no prerequisites needed.Google partnered with Udacity – an online education platform. They’re offering the program for $299 a month and is refundable when you don’t get a job within 6 months after graduating.The course can be finished within four weeks if the student commits six hours a week and after completing the course, they’d have to create two basic apps built in Android Studio.“Google, in partnership with Udacity, is making Android development accessible and understandable to everyone, so that regardless of your background, you can learn to build apps that improve the lives of people around you,” said Google on its developer blog.Participants will also learn how to interact with Web APIs, and use an SQLite database.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , , By using this site, you agree to our updated "},
{"title": ["Coordinator Layout on Android"], "body": "\n– is a “super-powered” FrameLayout\n\nWe can manage the behavior of direct childs with the parameter:\napp:layout_scrollFlags = scroll | <flag>\n\n– view will become visible when scrolling up\n– view will become visible when scrolling of the content reaches to the top.\n– minimum height of the toolbar will be reached before the rest of the content begins to scroll.\n– Upon a scroll ending, if the view is only partially visible then it will be snapped and scrolled to its closest edge.For RecyclerViews or NestedScrollView\n\nIf we want to create the collapsing toolbar effect, we must wrap the Toolbar inside CollapsingToolbarLayout.\n – is the view that enhances the behavior\n – who will serve as a trigger to interact with the child element. References:\n\n\nInnovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.  app:layout_behavior = @string/appbar_scrolling_view_behavior <string name=”appbar_scrolling_view_behavior” translatable=”false”>android.support.design.widget.AppBarLayout$ScrollingViewBehavior</string>ChildDependencypublic class YourClass extends CoordinatorLayout.Behavior<T>layoutDependsOn()onDependentViewChanged()Posted in , , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Android Design Support Library"], "body": "Few years back, Material Design was introduced by Google. However, some of its components were only available to Android 5.0 (Lollipop) or later. Because of this, backward compatibility has been a challenge for developers.Fortunately, with the release of Android Design Support Library, using Material Design’s components has been an easier task. You only need this single dependency:compile ‘com.android.support:design:23.2.0’Here are some of the Material Design visual components:Navigation View is placed within DrawerLayout and displays navigation items from the referenced menu resources. It has two key attributes: headerLayout (optional) and menu.TabLayout is an easier way to put tabs around a ViewPager which acts as sliding tabs between fragments within an app.TextInputLayout allows us to wrap EditText views in order to display floating labels above the EditText field. In addition to showing hints, you can also display an error message below the EditText.Snackbar is shown on the bottom of the screen and contains text with an optional single action. It is also swiped to dismiss. It is used for lightweight and quick feedback about an operation.References:Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint’s Counter Strike Tournament"], "body": "Every year, Stratpoint holds sports fests wherein 4 teams go against each other in various sports, activities, and table top games.This week was one of the much-awaited activities – The COUNTER STIKE  Tournament.Teams (Black, Green, Blue and Red) were represented by 5 of their best gamers.How fun is that?! Stratpoint is indeed a cool place to work!Standby for the list of winners!\nInnovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , By using this site, you agree to our updated "},
{"title": ["An Introduction to Swift 2.0"], "body": "One of Stratpoint’s iOS Developers, Mark Angeles shared his knowledge on Swift 2.0 with the rest of the team. Here is a summary of his talk.Swift Timeline\n – Chris Lattner began developing Swift\n – 1st Swift app and beta version were released\n – Swift 1.0 (Xcode 6.0)\n – Swift 1.1 (Xcode 6.1)\n – Swift 1.2 (Xcode 6.3)\n – Swift 2.0 (Xcode 7)\nObjective-C\nNSString *sampleString = @””;\nNSMutableArray *sampleArray = [[NSMutableArray alloc]init];\nNSMutableDictionary *sampleDictionary = [[NSMutableDictionary alloc]init];\nlet sampleConstantString: String = “”\nvar sampleVariableString: String = “”\nlet sampleConstantArray: NSMutableArray = NSMutableArray()\nvar sampleVariableArray: NSMutableArray = NSMutableArray()\nlet sampleConstantDictionary: NSMutableDictionary = NSMutableDictionary()\nvar sampleVariableDictionary: NSMutableDictionary = NSMutableDictionary()\nArray of strings = [@”John”, @”Mary”, @”Jacob”]\nObjectiv-C\nint index = 0;\nforin (NSString *name in array) {\n// Index of the object\nindex++;\n}\nfor (index, Name) in array.enumerate() {}Objective-C\n– (void)sampleFunction {}– (void)sampleFucntionWithParameter: (NSString *)parameter {}– (NSString *)sampleFunctionWithReturnValue {return @”Value”;}Swift\nfunc sampleFunction() {}func sampleFunctionWithParameter(parameter: String) {}func sampleFunctionWithReturnValue() -> String {return “Value”}Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Paco Sandejas at the Social Good Summit"], "body": "For the 5th time this year,  hosted the Philippine leg of the Social Good Summit. This year, the innovation process was taught throughout a solution-simulation forum where participants learned, connected, and took action!, an ideathon that harnessed the new democratic space in order to crowdsource “hacks” that aim to address core issues, was also introduced.The event, held at Green Sun Hotel, Makati on Saturday, September 24, was a treasure trove of bold insights on social good and tech disruption. (Rappler)Of course Stratpoint Chairman, Paco Sandejas was there as part of the panel talking about Technology and the Future. Here he shared what  (Stratpoint’s sister company) does in helping improve the quality of learning among Filipino students through the use of technology.Paco shared his enjoyment on his FB Page: Having a blast on the Social Good Summit of Rappler and Maria Ressa. Shared our work . ,  and Narra Ventures.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , , , , , By using this site, you agree to our updated "},
{"title": ["Reasons to outsource to the Philippines"], "body": " Here are some of the reasons why the Philippines is being considered as one of the Outsourcing capitals of the world. The Philippines has a status of emerging economy. Its GDP advanced 1.8 percent quarter-on-quarter in the June quarter of 2016, accelerating from an upwardly revised 1.3 percent expansion reported in the previous three months and in line with market expectations.In 2014, economic growth in the Philippines was strong, driven by strong foreign direct investment and expansion in the real estate, business process outsourcing (BPO) and mining sectors. The World Bank estimates growth of 6.7 percent in 2015. One of the main factors international clients outsource to the Philippines is the highly educated labor force. The country produces 450,000 or more graduates a year that are included in the qualified labor pool. The 95% literacy rate shows the country’s efforts to prioritize higher education. Their culture is Western-oriented and many of them have studied or worked in the US or being taught to speak with an American accent at school.On freelance marketplaces such as oDesk and Elance, Philippines is the third largest country represented. According to Forbes, there are approximately 2.3 million Americans registered on these sites, 1.9 million Indians, and 1.3 million Filipinos. For the past 10 years, the Philippine government has been prioritizing and promoting the industry. Government programs provide training for BPO applicants and give investors numerous benefits including tax holidays, tax exemptions, and simplified export and import procedures.The BPO sector is expanding at an average of 20 percent annually. Export revenues from BPO have grown from $1.3 billion in 2004 to $13.3 billion in 2013. IBPAP estimates that the sector generated $15 billion in total revenues in 2013, and expects revenues of $18 billion in 2014, and $25 billion in 2016.  References:Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , Tagged , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint Wellness Session: Hypertension"], "body": "Stratpoint gives importance to the health and awareness of its employees. The company makes it a point to invite doctors from different hospitals every quarter to discuss various disorders, diseases, infections, etc. for employees to have a clearer sense of what’s actually important – their health. Good health leads to better productivity.Yesterday Stratpoint held one of its wellness sessions with Dr. Julius Lizardo, MD, from Santa Ana Hospital. He discussed the causes and effects of hypertension.Some notes from his talk:Hypertension is a chronic medical condition in which the blood pressure in the arteries is elevated. Blood pressure is expressed by two measurements, the systolic and diastolic pressures, which are the maximum and minimum pressures.It contributes to the burden of heart disease, stroke and kidney failure and premature mortality and disability.Hypertension rarely causes symptoms in the early stages and many people go undiagnosed.There are significant health and economic gains attached to early detection, adequate treatment and good control of hypertension.Addressing behavioural risk factors, e.g.\nunhealthy diet, harmful use of alcohol and physical inactivity, can prevent hypertension.Tobacco use increases the risk of complications of hypertension.Salt reduction initiatives can make a major contribution to prevention and control of high blood pressure.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in Tagged , By using this site, you agree to our updated "},
{"title": ["Dado Banatao – Asia CEO Lifetime Contributor Awardee"], "body": " is the largest regular business event in Philippines and considered one of the most important in the Asia Pacific region. Events are organized by an alliance of Filipino and international business people with a mission to promote Philippines as a premier business destination to global decision makers.Asia CEO Forum functions as an activist to promote the activities of local and multinational organizations across Southeast Asia. Held in Manila, presenters are leaders in their industries and engaged in pursuits of significance to the entire region. is the largest business awards event in Philippines and Southeast Asia. Join the business elite of Philippines, Asia’s fastest growing economy, and the region for this grand celebration of achievement last Thursday, October 19, 2017  at the Marriott Grand Ballroom.Asia CEO Lifetime Contributor Awards were given to Albert Del Rosario for the Public Sector & Stratpoint Adviser, Dado Banatao for the Private Sector.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , By using this site, you agree to our updated "},
{"title": ["Stratpoint celebrates its 18th Anniversary"], "body": "Team Stratpoint couldn’t wait to celebrate a milestone – it’s 18th anniversary and the exciting Halloween party last Oct 26, 2016.Stratpoint has been offering services to consumer and enterprise markets since 1998. It began with specializing in mobile and web app development and is now offering a waide range of services including enterprise solutions – Adobe Experience Manager and Amazon Web Services. Stratpoint considers itself The company is celebrating 18 years of team synergy and excellent service.Here are some of the highlights from the event.   \nInnovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.fluent in the languages of digital technology. Posted in , , , Tagged , , , By using this site, you agree to our updated "},
{"title": ["Morning routines to pump you up for work"], "body": "We asked Team Stratpoint about their morning routines. What specific things do they do, things they think about, what inspires them or what drives them to go to work. Here are some of their witty answers!Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Brown Bag Session: QE is the new QA"], "body": "Stratpoint QA team attended a brown bag session led by Nina Gonzaga. Nina shared lessons she learned from the QA Track Seminar by Michelle Chua-Lagare.With limited headcount per team but with lots of products and releases to do, how do we catch up with testing? How do you meet higher expectations? Much more, how do you get that competitive edge in the market? The answer is transition from QA to QE.  . This session will tell you more about the difference of the two and what you can do to be QEs. Understand the biggest value that it brings as well as the challenges, steps and possible pitfalls in this testing evolution.“For people with non-technical backgrounds , how can we learn on how to code?”Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , Tagged , , , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint attends MATRADE events"], "body": "E-Commerce and ICT are emerging trends in the Philippines; Nearly 9 out of 10 Filipino Consumers do their shopping online and internet users are growing to 530% growth for the past 5 years.On September 6-7, 2016. Stratpoint attended the E-Commerce Show Philippines wherein The Embassy of Malaysia (Trade Office) or MATRADE brought in 21 Malaysian companies to the SMX Convention Center, Pasay, to give Malaysian ICT companies the opportunity to introduce their E-Commerce, Payment and Retails related ICT services to Philippine companies and to build a working relationship with them.To carry through this event, MATRADE invited local business associations, including Stratpoint to their thanksgiving lunch last Wednesday, Dec 5, 2016 at the Fairmont Hotel Makati.Opening remarks were given by Malaysian Trade Commissioner, Nyaee Ayup. Followed by discussions on Malaysia’s export capabilities and how it could Philippine companies.MATRADE believes that this event can act as an avenue to build a stronger partnership with Malaysian and Filipino ICT companies or other related industries.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["QA Performance Analysis, Baselining and Testing"], "body": "A brown bag session was held at Stratpoint wherein Jona Palma discussed the terms related to software performance and how it affects user processes and activities. Together with Jona is Kat Catacutan who tackled the performance testing, analysis, activities and validation. They conducted an activity in relation with the topic wherein speed, performance and bottlenecks are exhibited. These learnings were from the QA session by Enthony Go, which they attended from this year’s Softcon. This brown bag session aims to teach best practices so everyone can apply high quality services for all clients.The presentation will include a methodology on how to obtain significant performance metrics of critical scenarios under controlled conditions, how to use statistical analysisof metrics to determine performance baseline and trends, and testing and validating performance requirements using baselines and trends on customer environment. Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Importance of Automation"], "body": "Stratpoint QAs, Glorymar Garcia and Juanito Facundo Jr, lead a discussion on the importance of Automation and easy ways and points to remember on how non-technical QAs can perform automation. Another part of the session  discussed where we are on Stratpoint Automation (New Stratpoint Website – Frontend and CMS) These are lessons they learned from a seminar during the Softcon 2016, led by Kim Deloria.Here are some notes from the brown bag session.A manual testing team was given the mandate to automate their regression tests in Selenium. The problem was that none of them were technical and had very little knowledge of coding. Help came in the form of an automation framework that was intuitive and easy to follow. Building up this knowledge, they were able to build/code automation robust scripts that complemented their manual testing. This session will trace their journey on how they started and became successful in their automation journey.\nCMS Admin manual test cases\nSelenium Test Automation Framework\nCMS Admin Sanity test suite\nSelenium Grid environment setup\nContinuous Integration (Jenkins)\nCross-browser testing\nAppium integration (mobile testing)Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint celebrated Christmas with GentleHands, Inc. "], "body": " To celebrate Christmas season, we visited the kids from He Cares Mission. We’ve been tutoring them every other Saturday since November until Dec 10, 2016. For our last day with them, we organized a Christmas party with the kids together with the volunteers of Lingkod ng Panginoon, Greenhills.As soon as we got to their building, 30 bright smiles of really hyped up kids welcomed us. “Hello ates and kuyas” where we replied “Hi!!!” These were kids ages 7-10 years old, some were very shy some were really excited about what’s in store for them that day.We played parlor games which broke the ice for everyone. Both parties presented dance and song numbers, it was a pleasure to see all of kids having fun with new-found ates and kuyas for the day. Little by little, we noticed the kids talking, dancing, singing; showing us their talents, joking around with everyone! It was fun!Everyone was really happy to be able to share their blessings, some felt content with what they have. We all wanted to continue this even after the  season. It was the perfect way to end the day with so much generosity, love and appreciation in our hearts.  Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.ChristmasPosted in , , Tagged , , By using this site, you agree to our updated "},
{"title": ["Driving Development With Testing, From User Stories To Executable Specifications"], "body": "Sharing a bunch of learnings from a talk by Lorenzo Dee during the Softcon 2016, Kat Catacutan, Stratpoint QA, discussed the importance of requirements planning and analysis and how it affects the entire project and team. She mentioned the techniques and tools used in Agile methodology and conducted an activity that exhibits the significance of project requirements.Testing in Agile teams seems to be largely misunderstood. Some testers think that it is all about test automation. But is it all about test automation? And why does testing usually happen in the end? Yes, with agile teams, testers are involved much earlier in the life cycle (and programmers apply TDD practices). But still, testers cannot do any testing until some amount of software is developed. Can testers really help drive the development of the team?User stories are the most commonly used approach to gathering requirements. But where are the details? When and how are acceptance criteria written? Where do analysis fit in? The details can sometimes be ambiguous, confusing, or even inconsistent. What techniques can be applied to?This talk shows how testing is an integral part of Agile teams, and how testing guides the team in building the right “it” and not just building “it” right.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["What Philippine CEOs wish for this Christmas"], "body": "One of novelty Christmas songs I used to sing to my kids is “All I want for Christmas is my Two Front Teeth.” It reminds me that people have different priorities and wishes, and it could be as simple as having a complete set of front teeth.In Business Inquirer’s article entitled “All they want for Christmas…”, they asked a couple of CEOs in the Philippines on what they wish for this season – and again it is interesting to note the variety of wishes that were mentioned; it could be as expensive as a luxury car, or as simple as a Moleskine notebook.One of the respondents is Stratpoint Executive Chairman, Mr. Paco Sandejas, who is also the founder of Xepto Digital Education.According to Paco, his Christmas wish is “An extra Joma Spider-Man goalkeeper jersey and pants, because after one lucky chance to play again with my amazing ex-UP varsity teammates, I have been asked to play football again. I need to get more fit to keep up with the requirements of exciting times at Xepto Digital Education.”Other top business leaders who shared their wishes are from Coca-Cola, Citibank, ING Bank, Usana, Xurpas, and Samsung.Read more: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in By using this site, you agree to our updated "},
{"title": ["JavaScript: Why Should We Learn It"], "body": "Let’s start off with the fact that there’s a good chance that you are using a website powered by Javascript on a daily basis. Be it a modern website or not, most websites have at least a minimal trace of Javascript within its code.Javascript has been widely used on software development projects for more than twenty years. In 23 years, it has evolved from a simple scripting language to a game-changing programming language, thanks to the demand of modernization for most web applications. While it may be one of the oldest programming language around, it has been one of the most stable programming language that ever existed.Existing for two decades easily made the scripting language one of the most popular programming languages, according to the TIOBE Programming Community Index (). In fact, Javascript is the #1 most used programming language according to the 2016 Github programming language survey. It owes its popularity as a de facto language for web applications.Do not be mistaken that Javascript is only for web! Javascript also has frameworks for mobile applications development. Recent innovation to the language gave birth to perhaps one of Javascript’s most popular cross-platform runtime environment such as Node.js. Node.js uses a software engine called V8 Engine which allowed Javascript to be used as a middleware, and to access even native machine code.The modern JS environment is massive and can easily overwhelm the untrained with so many choices. This article will help you jumpstart by giving you a shortlist of the most recent, stable libraries that you can start using.You can use AngularJS (link), React (link), or Vue.js (link) as a front-end framework.If you need Javascript for your back-end server, you have either Express.js or Sails.js frameworks available as your REST API servers.Database requirements? You can use MongoDB for a NoSQL database or Sequelize for your traditional SQL database.Fancy data graphs for your presentation? D3.js or ChartJS will have you covered!Game development? Try Phaser.io for making games from scratch!All these libraries should be a good start for your JS project. Not only you will build your project on top of a solid, well-maintained codebase, you will save yourself from a lot of headaches because these libraries are known to be well-documented and troubleshooting resources are plentiful when you search on Google or StackOverflow.Should you find yourself looking for more libraries for a specific purpose like unit testing or array/object manipulations, check for what you need on either npm (Known as Node Package Manager) or Yarn (Package Manager developed by Facebook Engineers).Starting a single JS project can be very immersive, and in turn, very addictive. There’s always a new library for you to use! To be able to know how the Javascript is doing now and in the future, you can always read on to .One of the benefits of using JS frameworks on your projects lie on the fact that all of them are written on Javascript! Yes, it’s not uncommon for JS developers to mix-and-match libraries and frameworks. At the end of the day, you will always surprise yourself with what you can achieve and you would feel very productive as you carry on with your project.Now truly is a great time to be a Javascript developer! But what does it mean for you who looks forward to using Javascript as your primary programming language?It’s going to be a thrilling ride for anyone who wants to write a diverse programming language that has a class of its own together with a lively community. The Javascript community is very much alive, and will remain alive for the years ahead. In a world where everything starts to collaborate, it helps if you understand the language that can help you collaborate on the modern software development field.Reference: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , , , , , , By using this site, you agree to our updated "},
{"title": ["Front-end V.S. Back-end: One Or The Other"], "body": "Simply put, front-end programmers concern themselves with everything that has to do with the user interface while backend programmers handle the data being passed to and from the user/s. Full stack programmers are those who do both.In this article, I’d like to talk about how, in my opinion, you can’t be a full-stack web developer and be equally skilled at both front-end and backend programming. Many developers can do both but all, if not most, are better at one than the other. At the end of the day, it’s what you find to like doing more or what you’d consider more of your strong suit that really peaks your interest. And we all know that it’s easier to learn something you’re fond of.For one thing, they require the same kind of dedication and practice. I really think it takes focusing on one in particular, building a solid foundation on it and continuously developing that skill set in order to truly excel at it. With the many daily advances in technology nowadays, you can’t possibly keep up-to-date on both. And I’m sure I speak for everyone when I say that it’s difficult to keep a skill you don’t always use. I’ve managed to learn many things through application but have as easily managed to forget them out of practice. Mastering a skill not only takes time but it’s also important to have a strong background or at least the fundamental basics of something before you can advance at it.I, for one, take more of an interest developing the front-end side of a website. As I’ve observed, there are more women front-end web developers than men. I guess it’s because it entails a certain level of patience, consistency and attention to detail. I’m not saying men are less capable but I find that they prefer and are, quite frankly, better at handling the technical aspects of it all, e.g. the structuring of data, the processes and logic, etc..At the same time, you can’t say you’re a good front-end developer if you have no experience with backend programming. As separate as they are, they go hand-in-hand in integration. When you’re working with a team especially, it helps when you more or less have an idea on how each component, whether your responsibility of or not, works. In my experience, for example, because I’ve done both, I know what my backend counterpart needs me to implement in order to help make his/her tasks easier to execute. And that works both ways. It’s a lot easier to work with each other and maintain flexibility and efficiency code-wise when you understand each step of the development process.Then again, there are many frameworks and processors that help make web development a lot easier to learn and do nowadays, i.e. you don’t have to know the rudiments of a certain programming language, sometimes, to be able to use it. I, for example, studied the basics of PHP but can’t confidently say that I know what I know. But because of Laravel, for example, I don’t need to. Actually, if it weren’t for innovations like this, I don’t think I would have been able to catch up on my backend knowhow like I did. Major leaps in new methodologies are made everyday and as much as I’d like to expand my range of skills, I have a hard enough time doing so with my front-end programming.To conclude, I’ve met and worked with different kinds of programmers throughout my years as a professional and though I’ve encountered full-stack developers, they all specialize at either front-end or backend programming. It’s just something I wanted to explore a bit and talk/write about. Both roles are equally important and a lot of people don’t know the difference between the two. Like I said, front-end is more of my thing and as much as I’d like to be called a full-stack developer, it’s easier said than done.References:\nInnovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , Tagged , , , , , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint CEO attends the 17th Philippine Computing Science Congress in Cebu"], "body": "The Computing Society of the Philippines (CSP) in partnership with the University of San Carlos, Talampan Campus, hosted the 17th Philippine Computing Science Congress (PCSC2017) last March 16-18, 2017 in Cebu City.One of the speakers at the said conference is Stratpoint CEO, Mary Rose S. Dela Cruz, who presented her research on serverless architectures entitled: Serverless Architecture for Accelerated Software Development. Ms. Dela Cruz shared the benefits of using Amazon Web Services (AWS) Lambda and how it can help increase efficiency and reduce failure costs. Other speakers of PCSC2017 are Christopher Monterola of A*Star, Shengdong Zhao of the National University of Singapore, and Annette Lagman of the University of the Philippines, Diliman.The 17th Philippines Computing Science Congress gives an opportunity to students, ICT professionals, researchers, and computing educators to share their knowledge in the field of information technology, computer science, computer engineering, and the like. Other topics that were discussed in the conference are artificial intelligence, affective and emphatic computing, natural language processing, theory and algorithms, networking and pervasive computing, etc.Source: Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , By using this site, you agree to our updated "},
{"title": ["Brownbag Session: JavaScript ES6"], "body": "One indicator of a healthy software development company is in its ability to adapt and learn emerging technologies. Being in the software industry is all about knowledge sharing, after all. We never just learn something on our own, let alone we learn of the best practices right from the start.Here in Stratpoint, knowledge sharing is serious business. It’s not only we share knowledge for the sake of just sharing knowledge, but rather we share a collective of validated ideas and experiences among one another in many forms. It can range from simply sharing articles to someone, or via mentorship , and one of our favorites; in the form of brown bag sessions.Brown bag sessions are informal meetings held usually for an hour to discuss about almost anything under the sun. Anyone can share anything ranging from software development process, health and wellness, or financial strategies! The best thing about them is that they can be held anytime and everyone can attend.One of our brown bag sessions recently held is for the JavaScript’s most significant update, ECMAScript 2015, or commonly known in the software development circle as “ES6”.The recent brown bag session for ES6 served both as one-part quick brush up to JavaScript developers, and one part primer to everyone who wants to try out JavaScript but never knew where to actually start their learning adventure. The brown bag session was filled with several developers who are also experts in other programming languages like PHP, Java, Swift, and Ruby on Rails.The session discussed about the fundamental changes from the old version of JavaScript to its ES6 counterpart, and some new concepts for the language like Classes and Promises. Also discussed are some handy tricks and best practices when using any of the ES6 features.The goal of the brown bag session is to enable the attendees to branch out to currently popular JavaScript frameworks and libraries such as React, NodeJS, and AngularJS, using the fundamental knowledge that they have learned from the workshop. And should they choose to join the JavaScript developer ranks, they’re in good company. JavaScript is a multi-year awardee of being the most popular programming language according to the recent survey held by StackOverflow ().Knowing how to code in JavaScript nowadays is a vital knowledge for any developer looking to improve their skillsets. We’ve also published an article about why you should learn JavaScript. <cue “Why you should learn Javascript” article>.As digital experts, we at Stratpoint make it certain that we’re always one step ahead with emerging technologies. We take knowledge sharing as an art form where the passionate is welcome to share any of their methods or ideas. As such, the brown bag sessions are just one of the catalysts to our competency as a well-rounded software development company here in the Philippines.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , Tagged , , , , , , , , By using this site, you agree to our updated "},
{"title": ["Stratpoint Becomes Advanced Consulting Partner In The Amazon Web Services Partner Network (APN)"], "body": "     Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.2018 has really been great. Just last Friday, December 28, 2018, during the last day of work for the year, we received great news from our friends at  – Stratpoint is now an Advanced Consulting Partner in the .Stratpoint, has twenty (20) years of experience in software development for the enterprise and consumer markets. Stratpoint successfully developed and delivered mobile & web apps and solutions for clients in different industries such as telecommunications, retail, manufacturing, and finance.Stratpoint is the first to deploy a Serverless Microarchitecture in the Philippines, using the Lambda technology by Amazon, which allows designing of independent small components that form the application. Stratpoint also develops a comprehensive range of enterprise-grade solutions on  that provides highly scalable, reliable and secure end-customer user experiences.The AWS Partner Network (APN) is the global partner program for AWS. It is focused on helping APN Partners build successful AWS-based businesses or solutions by providing business, technical, marketing, and go-to-market support.APN Consulting Partners are professional services firms that help customers of all sizes design, architect, build, migrate, and manage their workloads and applications on AWS.APN Partners are focused on their clients’ success, helping customers take full advantage of all the business benefits that AWS has to offer. With their deep expertise on AWS, APN Partners are uniquely positioned to help their clients at any stage of their Cloud Adoption Journey and to help them achieve their business objectives.https://aws.amazon.com/partners/find/partnerdetails/?n=Stratpoint%20Technologies%20Inc&id=001E000001Alx5gIABhttps://aws.amazon.com/partners/https://aws.amazon.com/partners/consulting/journey/https://aws.amazon.com/solutions/database-migrations/?nc2=h_m2Posted in , , , , , By using this site, you agree to our updated "},
{"title": ["Narra Group of Companies Welcomes Mantua Consulting"], "body": "Mantua Consulting just held their Christmas Party last December 18, 2018 at the Makati Shangri-La Hotel. One of the guests invited is the Chief Executive Officer of Stratpoint Technologies, Inc., MR Dela Cruz. Mantua Consulting is an IT consulting company that offers planning and implementation of IT projects, up to information security standards compliance. They offer variety of services such as vulnerability assessment, penetration testing (VAPT), code review, phishing test, security implementation, and training.According to MR, Stratpoint is deepening their partnership through a strategic investment into Mantua Consulting.Stratpoint will be welcoming Mantua Consulting into the Narra Group of Companies in 2019.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , By using this site, you agree to our updated "},
{"title": ["Industrie 4.0 and Higher Education"], "body": "Last December 5, 2018, at the ISC Mezzanine Hall, Centro Escolar University (CEU) Manila, Stratpoint’s Chief Technology Innovation Officer, Jay Sabido, Ph.D. was invited to be one of the speakers of CEU’s Management Review to discuss “Industrie 4.0 and Higher Education”.Industry 4.0 was initially coined by the German government for their high-tech strategy. It has been widely adopted and now refers to the current trend of automation and data exchange. It includes cyber-physical systems, the Internet Of Things (IoT), cloud computing and cognitive computing. Industry 4.0 is commonly referred to as the fourth industrial revolution.There are some challenges in most traditional learning environments that sometimes cause graduates to face a world of transformed technology unarmed. Some mentioned the need to focus on quality educational experiences, the need to evolve outdated teaching methodologies, the imperative to prepare students to become part of the workforce of the future, skyrocketing operational costs, the need to keep tuition rates down, generation of students who are increasingly tuning-out and turning-off from the traditional approach of age-old instructional methods and a lot more. He also mentioned that customer preferences and expectations are constantly changing.The ever-evolving state of technology has impacted the way that people consume media and communicate with each other. Like “There must be an app for that” or comparisons like “Why can’t it be like Apple…or Waze…or Amazon… or Facebook…or Netflix… or…”The solution for these is Digital Transformation. Being digital means having physical products at the core, augmented by digital interfaces and data-based innovative services, working together with customers and suppliers in the industrial digital ecosystem.But it’s not about using technology to do the same things you’ve always done, only faster, cheaper, and better. It’s about using the technology to do things that weren’t possible before – creating new products and services that drive more revenue.So what role will higher education play in the next phase of this revolution? Why do Digital Transformation and Industry 4.0 matter? How should higher education leaders prepare their institutions for the changes ahead? Shown in the image below is a diagram of the Drivers in Higher Education.A number of alternative education models have emerged over the last decade such as massive open online courses (MOOC), bootcamps, learn now – pay later education, nanodegrees, and alternative credentialing.There are four key technologies that are driving innovation in the HE sector – Social, Mobile, Analytics, and Cloud (SMAC). There were at least 45% of College students in the States who have used social media as a learning tool. And about 85% TO 97% of the college students in the states use mobile phones for accessing student services. 81 % uses IoT devices. And US$9 billion HE cloud market size.Jay confidently went over this topic since Stratpoint has its expertise as a Digital Transformation Enabler. Stratpoint employs cutting-edge open source and cloud technologies for the top enterprises and start-ups in the U.S. and the Philippines.Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.Posted in , , , , , , , , , , , By using this site, you agree to our updated "},
{"title": ["The Conception of My First Python Package And What it Means to Contribute"], "body": "       Innovate. Deliver. Inspire.© Copyright 1998-2017 Stratpoint Technologies, Inc. All rights reserved.As an active seeker for good books, time and time again whenever there is something to look forward to, a book instantly gets into my stack waiting to be read in the near future. Whether it would be a good one or not, it would be up to the “me” who is at a certain space and time in the future. Whether that unique space, time, and circumstance will happen or not, the highlight to this paragraph is that I was still able to add a new body of knowledge to my stack; be it good or bad, just as academics and researchers aim to contribute to the pool of existing studies and theories. We’ll get to more of that later, but first, hear me out on how I created my first Python package and published it for anyone to use.I have been maintaining and improving a machine learning project that revolves around the Python language for quite some time. I rarely get the issue of actually needing to create a new functionality since there usually is an already existing Python package for it. Other times, even if I do have the need to create something complex, it only fits the use-case we have now.For added context, I dealt with a lot of Node JS code and one of the things that I love with Node JS is the vast amount of packages there is with the amazing NPM (Node Package Manager). It has a very active community that always maintains code and creates new packages for future re-use.Going back to Python, I was looking for a good logging module to better inform developers the various status we could face. Gladly enough, Python has an out-of-the-box option which allows you to log information, errors, and warnings, to name a few. What I felt tedious was enabling a mechanism to log with an available timestamp and better visuals out-of-the-box.  Unfortunately, no such immediate solution was available. I thought that I probably would be doing this for most of my remaining Python days. And so my journey begins to create a wrapper for Python’s logging module!The structure below will be our basis of how our package files will be arranged. You can have fun with how you populate content for the  and  file. I used the license for my purpose as a good starter. This will make sense later on when we start to publish our package.  my-new-logger\n  – – –   logger/\n  – – –   – – –   logger.py\n  – – –   – – –   __init__.py\n  – – –   test.py\n  – – –   setup.py\n  – – –   README.rst\n  – – –   LICENSE.txtTo start off, I idealized all of this as simple importing of the module I created and returns of the logger with initialized configurations of my liking. So I should first import the module we would be needing for the wrapper.  import logging\nAfter that, the very important function definition should be next. With the current logging module of Python, it allows you to input a name for the logger; we’ll add that capability as well to our extended wrapper.  defMyLogger(name = None):\nNow we highlight the part where I wanted better visuals for our logger. Fortunately, we can use ASCII color codes to allow this, which would look something like this:  actually makes all text after it turns to color blue.   MAGENTA  =  ‘\\033[95m’\n   BLUE  =  ‘\\033[94m’\n   GREEN  =  ‘\\033[92m’\n   YELLOW  =  ‘\\033[93m’\n   RED  =  ‘\\033[91m’\n   GREY  =  ‘\\033[0m’\n   WHITE  =  ‘\\033[1m’We then integrate these colors into the status we want to stand out.   logging.addLevelName(\n      logging.DEBUG,\n      ‘{}{}\\t{}’.format(WHITE, logging.getLevelName(logging.DEBUG), GREY))\n  logging.addLevelName(\n       logging.INFO,\n      ‘{}{}\\t{}’.format(GREEN, logging.getLevelName(logging.INFO), GREY))\n  logging.addLevelName(\n      logging.WARNING,\n      ‘{}{}\\t{}’.format(YELLOW, logging.getLevelName(logging.WARNING), GREY))\n  logging.addLevelName(\n      logging.ERROR,\n      ‘{}{}\\t{}’.format(RED, logging.getLevelName(logging.ERROR), GREY))\n  logging.addLevelName(\n      logging.CRITICAL,\n      ‘{}{}\\t{}’.format(MAGENTA, logging.getLevelName(logging.CRITICAL), GREY))\nLastly, we put all this together, from the names to the format that we need to be defined above. Note that we would be adding the timestamp, the name of the logger, the level of logging (which would be info and warning for example), and the actual message.  logger  =  logging.getLogger(__name__ if name isNoneelse name)\n  handler  =  logging.StreamHandler()\n  formatter  =  logging.Formatter(    ‘{}%(asctime)s %(name)-12s %(levelname)-8s %(message)s{}’.format(\nBLUE,\nGREY))\n  handler.setFormatter(formatter)\n  logger.addHandler(handler)\n  logger.setLevel(logging.DEBUG)\nOf course, we return the context of that logger. After putting it all together, we should have something like the one below:  import logging\n\n  defMyLogger(name = None, no_time = False):\n    MAGENTA = ‘\\033[95m’\n    BLUE = ‘\\033[94m’\n    GREEN = ‘\\033[92m’\n    YELLOW = ‘\\033[93m’\n    RED = ‘\\033[91m’\n    GREY = ‘\\033[0m’\n    WHITE = ‘\\033[1m’\n\n   logging.addLevelName(\n     logging.DEBUG,\n     ‘{}{}\\t{}’.format(WHITE, logging.getLevelName(logging.DEBUG), GREY))\n   logging.addLevelName(\n    logging.INFO,\n     ‘{}{}\\t{}’.format(GREEN, logging.getLevelName(logging.INFO), GREY))\n   logging.addLevelName(\n   logging.WARNING,\n     ‘{}{}\\t{}’.format(YELLOW, logging.getLevelName(logging.WARNING), GREY))\n  logging.addLevelName(\n   logging.ERROR,\n     ‘{}{}\\t{}’.format(RED, logging.getLevelName(logging.ERROR), GREY))\n  logging.addLevelName(\n   logging.CRITICAL,\n     ‘{}{}\\t{}’.format(MAGENTA, logging.getLevelName(logging.CRITICAL), GREY))\n\n  logger = logging.getLogger(__name__ if name isNoneelse name)\n  handler = logging.StreamHandler()\n  formatter = logging.Formatter(\n‘{}%(asctime)s %(name)-12s %(levelname)-8s %  (message)s{}’.format(BLUE, GREY))\n  handler.setFormatter(formatter)\n  logger.addHandler(handler)\n  logger.setLevel(logging.DEBUG)\n\n  return loggerTo make sure that everything is A-okay, we create a simple test file for sanity.  from logger import MyLogger\n\n  if __name__ == ‘__main__’:\n      logger = MyLogger(‘my logger’)\n      logger.info(‘my info’)\n      logger.warning(‘my warn’)\n      logger.error(‘my error’)\n      logger.debug(‘my debug’)\nWhen we run this file, we should get something like this:There you go! A Python program that does what I envisioned it to be, a working timestamp and better visuals for the information we get from the logs.The important thing to modify is the  file where we define the configurations we need to publish.  from distutils.core import setup\n\n  setup(\n     name=‘my-new-logger’,\n     version=‘0.1’,\n     description=‘wrapped logging’,\n     packages=[‘logger’,],\n     license=‘MIT’,\n     url = ‘https://github.com/username/reponame’,\n     download_url=‘https://github.com/username/reponame/archive/v_0.1.tar.gz’,\n     long_description=open(‘README.rst’).read(),\n     author=‘Your Awesome Name’,\n     author_email=‘your_awesome_email@awesomeprovider.com’\n  )\nThe next thing that I did is push this to a repository of my choice and add a new release. I created an account in PyPi for our package to have a container. I’ll leave this all up to you as we have various choices of control systems to use. After that, I installed a very handy-dandy tool called to help us with publishing.  pip install twineOnce everything is well and clean, we run the following scripts in order to start the publishing process.  python setup.py sdist\n  twine upload dist/*\nTo give more context on what’s happening, the first command bundles our package into a compressed file which stores it inside the  folder. The  command uploads that file to . Prepare to input your username and password you created from the previous step.That is how I created and published my first package into  due to my issue of not having good solutions to my problem.As programmers (or with any other tasks that demand repetition), we know how challenging it is when we’re assigned to do something while not having the right tools for it. The normal instinct would be to try and create the tool we need at the current use-case and then leave it there; without the opportunity to improve and be criticized.  Sure, that is perfectly fine. But isn’t it better to find the pieces of code that can work alone and be published for public use?I am not claiming that the wrapper I created is 100% state-of-the-art and should be the standard. I am not saying that no other package can compete with what I created. In fact, I would be much happier to find, along the way, a package that could fit more of my needs than what I have with my current package. Overall, the mindset should be to improve on what is available now or start a movement to create what is missing; to be able to contribute to the greater population. The journey that I took will be read by a few, who will learn from the mistakes I may have made with the use-case and might find a better way to do all this.The more we contribute, the more the tools we have around us improve. With better tools comes better output to our work. Better output of work entails satisfaction from our customers and the community. Posted in Tagged By using this site, you agree to our updated "}
]